app/views/pins/_form.html.haml

    %label= "Choose a Category"
    = f.collection_select :category_id, Category.all, :id, :name, {promt: "Choose a Category"}
---
SELECT "categories".* FROM "categories"