app/views/pins/edit.html.haml

SELECT "categories".* FROM "categories"
---
            %label= "Choose a Category"
            = f.collection_select :category_id, Category.all, :id, :name, {promt: "Choose a Category"}