app/views/pins/index.html.haml

SELECT COUNT(*) FROM "comments" WHERE "comments"."pin_id" = $1  [["pin_id", 7]]
---
        %p= "Comments:"
        %p= pin.comments.count