app/controllers/comments_controller.rb

  def create
    @pin = Pin.find(params[:pin_id])
    @comment = Comment.create(params[:comment].permit(:content))
    @comment.user_id = current_user.id
    @comment.pin_id = @pin.id

    if @comment.save
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "Hi"], ["created_at", "2015-06-23 19:33:07.868651"], ["updated_at", "2015-06-23 19:33:07.868651"]]
UPDATE "comments" SET "user_id" = $1, "pin_id" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["user_id", 1], ["pin_id", 3], ["updated_at", "2015-06-23 19:33:32.453722"], ["id", 3]]