app/controllers/pins_controller.rb

	def index
    if params[:category].blank?
      @pins = Pin.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @pins = Pin.where(category_id: @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "pins".* FROM "pins"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT 1  [["name", "Technology"]]
SELECT "pins".* FROM "pins" WHERE "pins"."category_id" = $1  ORDER BY created_at DESC  [["category_id", 12]]

  def show
    @comments = Comment.where(pin_id: @pin)
---
SELECT "comments".* FROM "comments" WHERE "comments"."pin_id" = 3

	def create
		@pin = current_user.pins.build(pin_params)
    if @pin.save
---
INSERT INTO "pins" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "TEST PIN"], ["description", "djfbjfdjfnsdjnf"], ["user_id", 1], ["created_at", "2015-06-18 02:34:19.688282"], ["updated_at", "2015-06-18 02:34:19.688282"]]

  def update
    if @pin.update(pin_params)
---
UPDATE "pins" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["title", "Devin Cohort-8"], ["description", "Devin Funny Shot"], ["updated_at", "2015-06-19 00:30:50.412597"], ["id", 3]]